Tekla Open API Reference for Tekla Structures 2025
Identifier.Equals Method
Overload List
Name | Description
Equals(Object)
 Compares the identifier with another object instance.
 (Overrides Object.Equals(Object).)
Equals(Identifier)
 Compares the identifier with another identifier instance.
Top
See Also
Reference
Identifier Class
Tekla.Structures Namespace